Mayank-Bankoti/LCD-Interfacing-with-LPC2148-4bit-mode/LCD.c
#include "lpc214x.h"
#include "LCD.h"
void lcd_send_cmd(char cmd);

void Delay(unsigned int i)
{
long x=0;
while(x!=i)
{
x++;
}
}

void lcd_init (void)
{

	Delay(10);
	lcd_send_cmd(0x02);
	lcd_send_cmd(0x28); // Function set --> DL=0 (4 bit mode), N = 1 (2 line display) F = 0 (5x8 characters)
	lcd_send_cmd(0x08); //Display on/off control --> D=0,C=0, B=0  ---> display off
	lcd_send_cmd(0x01);  // clear display
	lcd_send_cmd(0x06); //Entry mode set --> I/D = 1 (increment cursor) & S = 0 (no shift)
	lcd_send_cmd(0x0C); //Display on/off control --> D = 1, C and B = 0. (Cursor and blink, last two bits)
}


void send_to_lcd(char data, int rs)
{
    // Set or clear RS pin (P0.11) based on the 'rs' parameter
    if (rs == 1)
    {
        IOSET0 |= (1 << 11);  // Set RS (Register Select) pin
		IOCLR0 |= (	1<<	20);
		Delay(1000);
    }
    else
    {
        IOCLR0 |= (1 << 11);  // Clear RS (Register Select) pin
		IOCLR0 |= (	1<<	20);
		Delay(1000);
    }

    // Set data pins (P1.20 to P1.23) with the lower 4 bits of 'data'
    IOCLR1 |= 0xFF << 20;    // Clear data pins (P1.20 to P1.23)
    IOSET1 |= ((data & 0x0F) << 20);  // Set data pins with the lower 4 bits of 'data'

    // Toggle EN (Enable) pin (P0.20) to send the data
    IOSET0 |= (1 << 10);  // Set EN (Enable) pin
    Delay(10);            // Delay for a short duration
    IOCLR0 |= (1 << 10);  // Clear EN (Enable) pin to finish sending
    Delay(10);            // Delay for a short duration
}



void lcd_send_cmd(char cmd)
{
  	
	char datatosend;
	//Send Upper nibble firsr
	datatosend = ((cmd>>4) & 0x0F);
	send_to_lcd(datatosend,0);

	// Send lower nibble
	datatosend = ((cmd) & 0x0F);
	send_to_lcd(datatosend,0); 
}


void lcd_send_data(unsigned char data)
{
	char datatosend;
	
	//Send the higher nibble first
	datatosend = ((data >>4) & 0x0F);
	send_to_lcd(datatosend,1);

	//send lower nibble
	datatosend = data & (0x0F);
	send_to_lcd(datatosend,1);

}

//void lcd_clear (void)
//{
//	lcd_send_cmd(0x01);
//	HAL_Delay(2);
//}

void lcd_put_cur(int row, int col)
{
    switch (row)
    {
        case 0:
            col |= 0x80;
            break;
        case 1:
            col |= 0xC0;
            break;
    }

    lcd_send_cmd (col);
}



void lcd_send_string (char *str)
{
	while (*str) lcd_send_data (*str++);
}
